# -*- coding: utf-8 -*-
"""28_11_23_ task_4.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1txz2VoLnSt6a8b3ixMfmDCShHqYOGL4D
"""

################ Задание № 4
'''
Задание № 4. «Интеграция различных датчиков и устройств для расширения
функциональности беспилотных летательных аппаратов»
#######                          Задание       ######################

Инструкция:

Шаг 1. Напишите функцию получения данных с датчика GPS.

Шаг 2. Постройте визуализацию в виде графика изменения высоты полета.

Шаг 3. Постройте траекторию маршрута, используя данные о координатах с датчика GPS.

Шаг 4. Рассчитайте длину траектории полета.

'''


from random import uniform, randint
from numpy import round
import matplotlib
#matplotlib.use('TkAgg')
import matplotlib.pyplot as plt
from math import pi, sin, sqrt, atan2, cos

lat = 5546.95900
lon = 03740.69200
h = 142.0
t = 102030.000
list_data_gps = []
for i in range(15):
    lat += uniform(1.0, 1.5)
    lon += uniform(1.0, 1.5)
    h += uniform(-10.0, 20.0)
    t += randint(5, 20)
    s = '$GNGGA,'
    s += str(round(t, 3)) +'00,'
    s += str(round(lat, 5)) + ',N,'
    s += str(round(lon, 5)) + ',E,1,08,2.0,'
    s += str(round(h, 1)) + ',M,0.0,M,,*'
    list_data_gps.append(s)

def get_gps_data(s: str) -> dict:
    d = s.split(',')
    return {'time': float(d[1]), 'lon': float(d[2]), 'lat': float(d[4]), 'hight': float(d[9])}

def deg_to_rad(deg):
    return deg * pi / 180

def dist_ab(lat1, lon1, lat2, lon2):
    Erath_R = 6371

    dLat = deg_to_rad(lat2-lat1)
    dLon = deg_to_rad(lon2-lon1)

    lat1 = deg_to_rad(lat1)
    lat2 = deg_to_rad(lat2)

    a = sin(dLat/2)**2 + sin(dLon/2)**2 * cos(lat1) * cos(lat2)
    c = 2*atan2(sqrt(a), sqrt(1-a))
    return Erath_R * c


gps_data = []
for data in list_data_gps:
    gps_data.append(get_gps_data(data))

time_data = list(map(lambda x: x['time'], gps_data))
hight_data = list(map(lambda x: x['hight'], gps_data))
lon_data = list(map(lambda x: x['lon'], gps_data))
lat_data = list(map(lambda x: x['lat'], gps_data))

print('Шаг 2. График изменения высоты полета: ')
# построение графика изменения высоты
plt.plot(time_data, hight_data)
plt.title('h(t)')
plt.show()
print(' ')
print('Шаг 3. Траектория маршрута, с использованием данных о координатах с датчика GPS: ')
# построение траектории полета
fig = plt.figure(figsize=(8, 8))
ax_3d = fig.add_subplot(projection='3d')
ax_3d.plot(lon_data, lat_data, hight_data)
plt.show()

all_dist = 0
for i in range(len(lon_data)-1):
    all_dist += dist_ab(lat_data[i], lon_data[i], lat_data[i+1], lon_data[i+1])

print('')
print('Шаг 4. Длина траектории полета: ', all_dist)